BAS BMEKZU Project/src/Documents/ИНАГРО_ПриказНаПеремещение/ИНАГРО_ПриказНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_ПриказНаПеремещение</name>
  <attributes>
    <name>ВидХранения</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействияПриказа</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Примечание</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.ИНАГРО_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НовоеМестоХранения</name>
    <type>
      <types>CatalogRef.ИНАГРО_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДвиженияФормы36</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Урожай</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыУрожая</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидПеревозки</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыПеревозки</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтражатьВБухгалтерскомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТипЛабАнализа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Культуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизическийВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерАнализа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛабораторныйАнализ</name>
      <type>
        <types>DocumentRef.ИНАГРО_ЛабораторныйАнализ</types>
      </type>
    </attributes>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СорнаяПримесь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗерноваяПримесь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗачетныйВес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКоеффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/InformationRegisters/ОтветственныеЛица/ОтветственныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеЛица</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Documents/ИНАГРО_ПриказНаПеремещение/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииПечати

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Приказ
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Накладная";
	КомандаПечати.Представление = НСтр("ru='Накладная';uk='Накладна'");
   	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
    КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбораПриказа,ФормаДокумента";
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Реестр документов ""Приказ на перемещение""';uk='Реєстр документів ""Наказ на переміщення""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
        
        УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная", НСтр("ru='Накладная';uk='Накладна'"), 
            ПечатьНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_ПриказНаПеремещение.ПФ_MXL_Накладная", , Истина);
            
    КонецЕсли;
	
	
КонецПроцедуры

Функция ПечатьНакладная(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
    
    УстановитьПривилегированныйРежим(Истина);
    
    ЗапросШапка = Новый Запрос;
    ЗапросШапка.Текст =
		"ВЫБРАТЬ
		|	ИНАГРО_ПриказНаПеремещение.Организация.НаименованиеПолное КАК Организация,
		|	ИНАГРО_ПриказНаПеремещение.Номер КАК НомерДок,
		|	ИНАГРО_ПриказНаПеремещение.Дата КАК ДатаДок,
		|	ИНАГРО_ПриказНаПеремещение.Склад КАК Склад,
		|	ИНАГРО_ПриказНаПеремещение.Организация КАК ОрганизацияПредставление,
		|	ИНАГРО_ПриказНаПеремещение.Владелец КАК Владелец,
		|	ИНАГРО_ПриказНаПеремещение.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ИНАГРО_ПриказНаПеремещение.Ссылка КАК Ссылка,
		|	ИНАГРО_ПриказНаПеремещение.НовыйСклад КАК Куда
		|ИЗ
		|	Документ.ИНАГРО_ПриказНаПеремещение КАК ИНАГРО_ПриказНаПеремещение
		|ГДЕ
		|	ИНАГРО_ПриказНаПеремещение.Ссылка = &ТекущийДокумент";

    
    ЗапросКультуры = Новый Запрос;
    ЗапросКультуры.Текст =  
		"ВЫБРАТЬ
		|	ИНАГРО_ПриказНаПеремещениеКультуры.Номенклатура КАК Номенклатура,
		|	ИНАГРО_ПриказНаПеремещениеКультуры.ФизическийВес КАК Вес,
		|	ИНАГРО_ПриказНаПеремещениеКультуры.Влажность КАК Влажность,
		|	ИНАГРО_ПриказНаПеремещениеКультуры.СорнаяПримесь КАК СорнаяПримесь,
		|	ИНАГРО_ПриказНаПеремещениеКультуры.ЗерноваяПримесь КАК ЗерноваяПримесь,
		|	ИНАГРО_ПриказНаПеремещениеКультуры.ЗачетныйВес КАК ЗачетныйВес
		|ИЗ
		|	Документ.ИНАГРО_ПриказНаПеремещение.Культуры КАК ИНАГРО_ПриказНаПеремещениеКультуры
		|ГДЕ
		|	ИНАГРО_ПриказНаПеремещениеКультуры.Ссылка = &ТекущийДокумент";
                        
    ТабДокумент = Новый ТабличныйДокумент;
    ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_ПриказНаПеремещение.Накладная";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_ПриказНаПеремещение.ПФ_MXL_Накладная");
    
    // печать производится на языке, указанном в настройках пользователя
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    ПервыйДокумент = Истина;

    Для каждого Ссылка Из МассивОбъектов Цикл
        
        Если Не ПервыйДокумент Тогда
            ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;
        ПервыйДокумент = Ложь;
        
        // Запомним номер строки, с которой начали выводить текущий документ.
        НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
        
        ЗапросКультуры.УстановитьПараметр("ТекущийДокумент", Ссылка);
        РезультатКультуры = ЗапросКультуры.Выполнить().Выгрузить();
        
        ЗапросШапка.УстановитьПараметр("ТекущийДокумент", Ссылка);
        РезультатШапка = ЗапросШапка.Выполнить().Выбрать();
        РезультатШапка.Следующий();
        
        Шапки = Макет.ПолучитьОбласть("Шапка");	
        
        Шапки.Параметры.Заполнить(РезультатШапка);	
        ВремяНачалаДня              = ИНАГРО_Элеватор.ПолучитьПараметрУчетаЭлеватора(РезультатШапка.ДатаДок, "ВремяНачалаДня", 0);
        Шапки.Параметры.ДатаДок     = Формат(РезультатШапка.ДатаДок, "ДФ='дд ММММ гггг';Л="+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
        ЗавСкладомСрез              = РегистрыСведений.ОтветственныеЛица.СрезПоследних(РезультатШапка.ДатаДок,Новый Структура ("СтруктурнаяЕдиница",РезультатШапка.Склад));
        ЗавНовогоСкладаСрез         = РегистрыСведений.ОтветственныеЛица.СрезПоследних(РезультатШапка.ДатаДок,Новый Структура ("СтруктурнаяЕдиница",РезультатШапка.Куда));
         
        Если ЗавСкладомСрез.Количество()<>0 Тогда
            Шапки.Параметры.ЗавСкладом = ЗавСкладомСрез[0].ФизическоеЛицо;
        КонецЕсли;
        
        Если ЗавНовогоСкладаСрез.Количество()<>0 Тогда
            Шапки.Параметры.ЗавНовымСкладом = ЗавНовогоСкладаСрез[0].ФизическоеЛицо;	
        КонецЕсли;
        ТабДокумент.Вывести(Шапки);
        
        // Строка	
        ОблСтрока = Макет.ПолучитьОбласть("Строка");
        ЗачВес = 0;
        Для каждого Строка Из РезультатКультуры Цикл
            ОБлСтрока.Параметры.Заполнить(Строка);
            
            ПараметрыДляРасчетаЗачетногоВеса = Новый Структура(
            "Ссылка, Дата, Организация,
            |Владелец, ДоговорКонтрагента, Номенклатура,
            |Склад, Влажность, СорнаяПримесь,
            |ФизическийВес, ЗачетныйВес,     
            |");
            
            ЗаполнитьЗначенияСвойств(ПараметрыДляРасчетаЗачетногоВеса, Строка);
            ЗаполнитьЗначенияСвойств(ПараметрыДляРасчетаЗачетногоВеса, РезультатШапка);
            ПараметрыДляРасчетаЗачетногоВеса.Вставить("ФизическийВес",Строка.Вес);
            ПараметрыДляРасчетаЗачетногоВеса.Вставить("Организация",РезультатШапка.Организация);
            ПараметрыДляРасчетаЗачетногоВеса.Вставить("Дата",РезультатШапка.ДатаДок);

            ЗачетныйВес = ИНАГРО_Элеватор.ЗачетныйВесПриПроведении(ПараметрыДляРасчетаЗачетногоВеса);
            ОблСтрока.Параметры.ЗачетныйВес = ЗачетныйВес;
            ЗачВес = ЗачетныйВес + ЗачВес;
            ТабДокумент.Вывести(ОблСтрока);
        КонецЦикла;                  
        
        // итого зачетного веса
        ТЗ = Новый ТаблицаЗначений;
        ТЗ.Колонки.Добавить("ЗачВес");
        Стр = ТЗ.Добавить();
        Стр.ЗачВес = ЗачВес;
        Итого = ТЗ.Итог("ЗачВес");
        
        //Дно
        ОблДно = Макет.ПолучитьОбласть("Дно");
        ОблДно.Параметры.ВесИтого = РезультатКультуры.Итог("Вес");
        ОблДно.Параметры.ЗачетныйВесИтого = Итого;
        Руководители = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизации(РезультатШапка.ОрганизацияПредставление, РезультатШапка.ДатаДок);
        ОблДно.Параметры.ФИОДиректора = Руководители.Руководитель;
        ОблДно.Параметры.НачальникВТЛ = Руководители.НачальникВТЛ;
        
        ТабДокумент.Вывести(ОблДно);	
        
        ОблРазделитель = Макет.ПолучитьОбласть("Разделитель");
        ТабДокумент.Вывести(ОблРазделитель);
        
        УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
        НомерСтрокиНачало, ОбъектыПечати, Ссылка);
        
	КонецЦикла;
	
    Возврат ТабДокумент;
    
КонецФункции

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
